docs/quota/quota2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>quota2</title>
<!-- 2015-04-05 Sun 12:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dmitry Monakhov" />
</head>
<body>
<div id="content">
<h1 class="title">quota2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Quota todo list</a>
<ul>
<li><a href="#sec-1-1">Investigate XFS project id internals</a></li>
<li><a href="#sec-1-2">Add tree id to ext4 inode</a>
<ul>
<li><a href="#sec-1-2-1">Prohibit bad operations like</a></li>
<li><a href="#sec-1-2-2">Add runtime checks for inapropriate tree.</a></li>
</ul>
</li>
<li><a href="#sec-1-3">Add tree quota support to ext4</a></li>
<li><a href="#sec-1-4">Add separate tree/usr quota id for ext4</a>
<ul>
<li><a href="#sec-1-4-1">Extend qutid<sub>t</sub> type to 64 bit (Change all interfaces to use this bits)</a></li>
<li><a href="#sec-1-4-2">Investigate quota file format v0</a></li>
<li><a href="#sec-1-4-3">Create 64-bit quota file format</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Quota todo list</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Investigate XFS project id internals</h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Add tree id to ext4 inode</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Prohibit bad operations like</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ul class="org-ul"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a>rename<br  /><div class="outline-text-5" id="text-1-2-1-1">
<ol class="org-ol">
<li>disallow for all types where ddir-&gt;tree<sub>id</sub> != sdir-&gt;tree<sub>id</sub>
</li>
<li>allow for all types except DIR, and i<sub>lnk</sub> != 1
</li>
</ol>
</div>
</li>
<li><a id="sec-1-2-1-2" name="sec-1-2-1-2"></a>link<br  /><div class="outline-text-5" id="text-1-2-1-2">
<p>
allow only if src-&gt;tree<sub>id</sub> == dst-&gt;tree<sub>id</sub>
</p>
</div>
</li></ul>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">Add runtime checks for inapropriate tree.</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
In fact some one may turn-off TREE<sub>ID</sub> mount flag and then mix up tries
content. Later TREE<sub>ID</sub> flag may passed on new mount (remount are not possible) 
We have to check what tree inheritance assumption is ok.
</p>
</div>
<ul class="org-ul"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a><span class="todo TODO">TODO</span> define inheritance assumptions<br  /></li>
<li><a id="sec-1-2-2-2" name="sec-1-2-2-2"></a><span class="todo TODO">TODO</span> find suitable place for checks<br  /><div class="outline-text-5" id="text-1-2-2-2">
<p>
suitable place is following where we have parent dentry and child dentry
The check must being done only once because it is not possible to change
it back.
Probably ext4<sub>lookup</sub> is a good candidate for that.
In case of error inode will be marked as containg bad quota.
this may result in troubles because it may already contain quota info.
In this case we have to print <span class="underline">huge</span> warning msg and drop quota.
</p>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Add tree quota support to ext4</h3>
<div class="outline-text-3" id="text-1-3">
</div><ul class="org-ul"><li><a id="sec-1-3-0-1" name="sec-1-3-0-1"></a>Testing<br  /><div class="outline-text-5" id="text-1-3-0-1">
<ul class="org-ul">
<li>Add tree id support to fsstress.
</li>
<li>add mv rename operation.
</li>
</ul>
</div>
</li></ul>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Add separate tree/usr quota id for ext4</h3>
<div class="outline-text-3" id="text-1-4">
<p>
This task must being done in following steps
</p>
</div>
<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">Extend qutid<sub>t</sub> type to 64 bit (Change all interfaces to use this bits)</h4>
</div>
<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">Investigate quota file format v0</h4>
</div>
<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">Create 64-bit quota file format</h4>
<div class="outline-text-4" id="text-1-4-3">
</div><ul class="org-ul"><li><a id="sec-1-4-3-1" name="sec-1-4-3-1"></a>Testing<br  /><div class="outline-text-5" id="text-1-4-3-1">
<p>
It must being tested with fsstress like follows on ext4:
</p>
<ul class="org-ul">
<li>decode id = (id &lt;&lt; 32) + ~((int)id)
</li>
<li>decode id = (id &lt;&lt; 32) + tree<sub>id</sub>  
</li>
</ul>
</div>
</li></ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dmitry Monakhov</p>
<p class="date">Created: 2015-04-05 Sun 12:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
